---
kind: type
id: T:Autodesk.Revit.DB.ConnectorType
source: html/769d8156-55b0-bda8-9e8f-f81fce49f1af.htm
---
# Autodesk.Revit.DB.ConnectorType

An enumerated type listing all connector types for a connection

## Syntax (C#)
```csharp
public enum ConnectorType
```